# Множини щось подібне до об'єктів тільки без ключів
# Не можна звернутися до певного елемента за індексом чи номером чи будь як
# У множинах дані перемішуються кожного разу, тому не можна відслідкувати елемент

# data = {1, 2, "Inna", True, 6}
# # Видаляємо останній елемент
# data.pop()
# # Додаємо один елемент
# data.add(5)
# # Додаємо список, але якщо в ньому є повторювані елементи то вони не додаються
# data.update(["4", 6, 24.5])
# print(data)
# data.remove(6)
# print(data)

# nums = [1, 2, 3, 4, 5, 4, 5, 6]
# # Видалення дублікатів
# res = set(nums)
# print(res)

# word = "Hello"
# res = set(word)
# print(res)

# frozenset

# data = frozenset([1, 2, "Inna", True, 6])